In [1]:
import pandas as pd
from datetime import datetime, timedelta
import numpy as np
from itertools import dropwhile
import sys
sys.path.insert(0, '/home/shail/bits/PS1/time_series_analysis')

In [2]:

df = pd.DataFrame([[10  ,      "Mumbai"   ,  '2015-12-01'  ]   ,               
   [1 ,       "Bangalore" , '2016-01-12'],
   [12    ,    "Pune"    ,   '2016-02-24'],
   [4    ,    "Mumbai"  ,    '2016-04-01'],
   [15   ,     "Delhi" ,     '2016-04-03'],
   [6   ,     np.nan   ,    '2016-05-12'],
   [14    ,    "Bangalore" ,   '2016-06-05'],
  [ 5   ,     np.nan    ,   '2016-07-31'],
   [8   ,     "Mumbai"  ,   '2016-12-19']], columns = ['value', 'city', 'date'])

In [3]:
df

   value       city        date
0     10     Mumbai  2015-12-01
1      1  Bangalore  2016-01-12
2     12       Pune  2016-02-24
3      4     Mumbai  2016-04-01
4     15      Delhi  2016-04-03
5      6        NaN  2016-05-12
6     14  Bangalore  2016-06-05
7      5        NaN  2016-07-31
8      8     Mumbai  2016-12-19

In [4]:
def impute_categorical_with_mode(col: pd.Series):
    '''
        imputes null values in categorical variables
        
        Args:
            - col (pd.Series): series of variable to be imputed
        
        Returns:
            - (pd.Series): series with no nans
    '''
    d = col.value_counts().to_dict()
    max(d, key = lambda x: d[x])
    new_col = col.fillna(max(d, key = lambda x: d[x]))
    return new_col

In [5]:
impute_categorical_with_mode(df['city'])

0       Mumbai
1    Bangalore
2         Pune
3       Mumbai
4        Delhi
5       Mumbai
6    Bangalore
7       Mumbai
8       Mumbai
Name: city, dtype: object